app/controllers/api/v1/auth_controller.rb

      def create
        user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pvnswamy74@gmail.com"], ["LIMIT", 1]]